# brew bundle install --file=~/Brewfile [--cleanup]

# Ory
tap "cockroachdb/tap"

brew "ag"
brew "age"
brew "cargo-flamegraph"
brew "cloc"
brew "difftastic"
brew "entr"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnuplot"
brew "golang"
brew "graphviz"
brew "hyperfine"
brew "htop"
brew "jq"
brew "lld"
brew "llvm"
brew "lua-language-server"
brew "nasm"
brew "neovim"
brew "parallel"
brew "qemu"
brew "ripgrep"
brew "samply"
brew "tokei"
brew "tree"
brew "xsv"
brew "zig"

cask "firefox"
cask "karabiner-elements"
cask "kitty"
cask "wine-stable", args: { no_quarantine: true }

# Ory

brew "caddy"
brew "cmake"
brew "cockroach"
brew "coreutils"
brew "delve"
brew "gh"
brew "k9s"
brew "kubectl"
brew "mysql-client@8.0"
brew "node@22"
brew "openjdk@11"
brew "pkcs11-tools"
brew "postgresql@16"
brew "rust"
brew "shellcheck"
brew "skaffold"
brew "softhsm"

cask "docker-desktop"
cask "gcloud-cli"
cask "google-cloud-sdk"
cask "virtualbox"
