# brew bundle install --file=~/Brewfile [--cleanup]


tap "hashicorp/tap"

brew "difftastic"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "golang"
brew "htop"
brew "jq"
brew "neovim"
brew "parallel"
brew "ripgrep"

cask "firefox"
cask "kitty"

# Ory

brew "coreutils"
brew "delve"
brew "gh"
brew "go-jsonnet"
brew "graphviz"
brew "grype"
brew "k9s"
brew "kubectl"
brew "markdownlint-cli"
brew "npm"
brew "skaffold"
brew "vale"

cask "docker"
cask "google-cloud-sdk"
cask "vagrant"
cask "virtualbox"
