# brew bundle install --file=~/Brewfile [--cleanup]

# Ory
tap "cockroachdb/tap"
tap "microsoft/git"

brew "ag"
brew "difftastic"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "git-delta"
brew "golang"
brew "htop"
brew "jq"
brew "neovim"
brew "parallel"
brew "qemu"
brew "ripgrep"
brew "sd"
brew "tokei"
brew "xsv"

cask "firefox"
cask "kitty"
cask "rectangle"
cask "wine-stable", args: { no_quarantine: true }

# Ory

brew "caddy"
brew "cmake"
brew "cockroach"
brew "coreutils"
brew "delve"
brew "gh"
brew "go-jsonnet"
brew "graphviz"
brew "grype"
brew "k9s"
brew "kubectl"
brew "markdownlint-cli"
brew "mysql-client@8.0"
brew "npm"
brew "openjdk@11"
brew "pkcs11-tools"
brew "skaffold"
brew "socat"
brew "softhsm"
brew "vale"

cask "docker"
cask "google-cloud-sdk"
cask "microsoft-git"
cask "virtualbox"
